#include "Actor.h"

/**********************************/
/*関数名 : Actor                  */
/*戻り値 : 無し                   */
/*引数   : 無し                   */
/*処理   : コンストラクタ         */
/*備考   : 無し                   */
/**********************************/
Actor::Actor(class Game* game)
	:mGame(game),
	 mState(EActive)
{
	//アクターの生成時にGameクラスで管理するActorに自身のポインタを追加する
	mGame->AddActor(this);
}

/**********************************/
/*関数名 : ~Actor                 */
/*戻り値 : 無し                   */
/*引数   : 無し                   */
/*処理   : デストラクタ           */
/*備考   : 無し                   */
/**********************************/
Actor::~Actor()
{
	mGame->RemoveActor(this);
}

/**********************************/
/*関数名 : Update                 */
/*戻り値 : 無し                   */
/*引数   : deltaTime(ゲーム内時間)*/
/*処理   : 更新処理               */
/*備考   : 無し                   */
/**********************************/

void Actor::Update(float deltaTime)
{
	if (mState == EActive)
	{
	}
}
